app/Controllers/categories.php

    public function index()
    {
        if(session()->get('logged_in') == false)
        {
            return redirect()->to(base_url() . 'public/login');
        }
        $categoryModel = new CategoryModel();
        $categories['categories_List'] = $categoryModel->findAll();
---
SELECT *
FROM `categories`