app/Controllers/login.php

    public function auth()
    {
        $session = session();
        $model = new UserModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $data = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'me@gmail.com'
 LIMIT 1